Revit 2027 API
AnnotationMultipleAlignmentUtils.ElementSupportsMultiAlign Method
 Returns true if element can be aligned to other similar elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ElementSupportsMultiAlign(
	Element element
)
Public Shared Function ElementSupportsMultiAlign (
	element As Element
) As Boolean
public:
static bool ElementSupportsMultiAlign(
	Element^ element
)
static member ElementSupportsMultiAlign :
        element : Element -> bool
Parameters
element Element
 The element to align.
Return Value
Boolean
 True if the element can be aligned using the multiple alignment commands, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace